@melinath @kautikdk I pushed new code implementing what has been discussed here. To summarize:
- Moved IAM to a handwritten resource
- Added force_destroy virtual field mapped to the allowNonEmpty query parameter
- Minor documentation fixes

@melinath I'm having issues with the IAM tests. I'm trying a simple example such as this:
```
resource "google_storage_managed_folder" "folder" {
  bucket = google_storage_bucket.bucket.name
  name   = "managed/folder/name123"
}

resource "google_storage_managed_folder_iam_binding" "foo" {
  bucket         = google_storage_managed_folder.folder.bucket
  managed_folder = google_storage_managed_folder.folder.name
  role           = "roles/storage.objectViewer"
  members        = ["user:xxx@example.com"]
}
```

If I run this I get an inconsistent state error:
```
│ Error: Provider produced inconsistent final plan
│
│ When expanding the plan for google_storage_managed_folder_iam_binding.foo to include new values learned so far during apply, provider "registry.terraform.io/hashicorp/google" produced
│ an invalid new value for .managed_folder: was cty.StringVal("managed/folder/name123"), but now cty.StringVal("managed/folder/name123/").
│
│ This is a bug in the provider, which should be reported in the provider's own issue tracker.
╵
```
However, it succeeds if I create the folder first and then in a separate run I create the binding:
```
❯ tfa
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in REDACTED
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
google_storage_bucket.bucket: Refreshing state... [id=tf-test-my-bucket123dd1]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_managed_folder.folder will be created
  + resource "google_storage_managed_folder" "folder" {
      + bucket         = "tf-test-my-bucket123dd1"
      + create_time    = (known after apply)
      + force_destroy  = false
      + id             = (known after apply)
      + metageneration = (known after apply)
      + name           = "managed/folder/name123"
      + self_link      = (known after apply)
      + update_time    = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_storage_managed_folder.folder: Creating...
google_storage_managed_folder.folder: Creation complete after 0s [id=tf-test-my-bucket123dd1/managed/folder/name123]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.



❯ tfa
╷
│ Warning: Provider development overrides are in effect
│
│ The following provider development overrides are set in the CLI configuration:
│  - hashicorp/google in REDACTED
│
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with published releases.
╵
google_storage_bucket.bucket: Refreshing state... [id=tf-test-my-bucket123dd1]
google_storage_managed_folder.folder: Refreshing state... [id=tf-test-my-bucket123dd1/managed/folder/name123]

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_storage_managed_folder_iam_binding.foo will be created
  + resource "google_storage_managed_folder_iam_binding" "foo" {
      + bucket         = "tf-test-my-bucket123dd1"
      + etag           = (known after apply)
      + id             = (known after apply)
      + managed_folder = "managed/folder/name123/"
      + members        = [
          + "user:xxx@example.com",
        ]
      + role           = "roles/storage.objectViewer"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

google_storage_managed_folder_iam_binding.foo: Creating...
google_storage_managed_folder_iam_binding.foo: Creation complete after 4s [id=b/tf-test-my-bucket123dd1/managedFolders/managed/folder/name123//roles/storage.objectViewer]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.


```

This behavior is causing all the IAM tests to fail. Any ideas?